# coding=utf-8

# 我们自定义了一个基于UDP的网络协议，按照固定次序向服务器传递一系列参数：
# hwDetect:     "<0112>"
# gxDepthBits:  "<32>"
# gxResolution: "<1024x768>"
# gxRefresh:    "<60>"
# fullAlpha:    "<1>"
# lodDist:      "<100.0>"
# DistCull:     "<500.0>"
# 在程序中我们将各个参数按次序收集到列表中：
# ["<0112>","<32>","<1024x768>","<60>","<1>","<100.0>","<500.0>"]
# 最终我们要把各个参数拼接成一个数据报进行发送：
# "<0112><32><1024x768><60><1><100.0><500.0>"

pl = ["<0112>","<32>","<1024x768>","<60>","<1>","<100.0>","<500.0>"]

# 方法1：迭代列表，连续使用+操作一次拼接每一个字符串
s = ''
for p in pl:
    s += p
print s

# 方法二：使用str.join()方法，更加快速的拼接列表中所有字符串 (推荐)
print ''.join(pl)

# 如果列表中存在字符串和数字,使用生成器表达式
l = ['abc', 123, 45, 'xyz']
print ''.join(str(x) for x in l)